Revit 2024 API
BuiltInFailures.SiteFailures.SurfaceSplit Property
 The splitting boundary must split the Surface into exactly two pieces.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId SurfaceSplit { get; }
Visual Basic
Public Shared ReadOnly Property SurfaceSplit As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ SurfaceSplit {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.SiteFailures Class
Autodesk.Revit.DB Namespace